Дошкольное_учреждение83/src/Documents/удуВыдачаМетодическихМатериалов/удуВыдачаМетодическихМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуВыдачаМетодическихМатериалов</name>
  <registerRecords>AccumulationRegister.удуМетодическиеМатериалыНаРуках</registerRecords>
  <attributes>
    <name>Читатель</name>
    <type>
      <types>CatalogRef.удуСотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВозвратаОбщая</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВыдачи</name>
    <type>
      <types>CatalogRef.удуПричиныВыдачиМетодическихМатериалов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МетодическиеМатериалы</name>
    <attributes>
      <name>УчетнаяЕдиница</name>
      <type>
        <types>CatalogRef.удуУчетныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>CatalogRef.удуИнвентарныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВозврата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоступноеКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/AccumulationRegisters/удуМетодическиеМатериалыНаРуках/удуМетодическиеМатериалыНаРуках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>удуМетодическиеМатериалыНаРуках</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>УчетнаяЕдиница</name>
    <type>
      <types>CatalogRef.удуУчетныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>CatalogRef.удуИнвентарныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Читатель</name>
    <type>
      <types>CatalogRef.удуСотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПлановаяДатаВозврата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаВыдачи</name>
    <type>
      <types>CatalogRef.удуПричиныВыдачиМетодическихМатериалов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Дошкольное_учреждение83/src/Documents/удуВыдачаМетодическихМатериалов/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Автор = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Если МетодическиеМатериалы.Количество() = 0 Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Движения.удуМетодическиеМатериалыНаРуках.Записывать = Истина;
	Для Каждого ТекСтрокаМетодическиеМатериалы Из МетодическиеМатериалы Цикл
		
		Если ТекСтрокаМетодическиеМатериалы.Количество > 0 Тогда
			
			Движение = Движения.удуМетодическиеМатериалыНаРуках.Добавить();
			
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.УчетнаяЕдиница = ТекСтрокаМетодическиеМатериалы.УчетнаяЕдиница;
			Движение.ИнвентарныйНомер = ТекСтрокаМетодическиеМатериалы.ИнвентарныйНомер;
			Движение.Читатель = Читатель;
			ДатаВозврата = ТекСтрокаМетодическиеМатериалы.ДатаВозврата;
			ДатаВозврата = ?(ДатаВозврата = '00010101', ДатаВозвратаОбщая, ДатаВозврата);
			Движение.ПлановаяДатаВозврата = ДатаВозврата;			
			Движение.ПричинаВыдачи = ПричинаВыдачи;
			Движение.Количество = ТекСтрокаМетодическиеМатериалы.Количество;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры
